{"name": "LIVIA HOOVER", "profile": "Seeking Position in Human/Social Service Administration or related field utilizing strong academic background, experience and excellent interpersonal skills", "skills": ["Manage a caseload of twenty consumers", "Facilitate group sessions", "Plan and implement social activities", "Coordinate and conduct team meetings", "Process billings", "Manage petty cash fund", "Arranged and facilitated weekend activities", "Contacted families to set up dates and times to review and discuss care plans", "Delivered and read mail to residents", "Provided companionship and social interaction", "Filed confidential paperwork", "Provided receptionist/administrative support", "Conducted group job search training sessions", "Assisted consumers with completion of job applications, cover letters and resumes", "Responded to crisis calls", "Provided support to victims of domestic abuse", "Completed paperwork to document circumstances surrounding alleged abuse for judicial review", "Conducted tours", "Provided orientation and general assistance for new residents", "Completed social histories", "Inventoried clothing", "Met one-on-one with residents to help them understand their rights and responsibilities", "Assisted the Center in meeting critical staffing needs during peak times by working as a certified nursing assistant, dietary aide, receptionist and van driver"], "employment": [{"role": "Day Rehabilitation Specialist", "company": "Greater NE Goodwill Industries", "responsibilities": "Manage a caseload of twenty consumers, assist them in setting and reaching individual plans. Facilitate group sessions on Mental Illness, Stress Management and Healthy Relationships. Plan and implement social activities for consumers. Coordinate and conduct team meetings. Process billings, manage petty cash fund, and oversee operations in supervisor’s absence", "date": "June 20xx – Present"}, {"role": "Assistant Receptionist", "company": "Tiffany Square Care Center", "responsibilities": "Arranged and facilitated weekend activities for residents. Contacted families to set up dates and times to review and discuss care plans. Delivered and read mail to residents, providing companionship and social interaction. Filed confidential paperwork and provided receptionist/administrative support for the Center", "date": "Jan – June 20xx"}, {"role": "Employment Trainer", "company": "Central NE Goodwill Industries", "responsibilities": "Managed a caseload of twenty consumers and provided on-the-job coaching to help them succeed. Conducted group job search training sessions and assisted consumers with completion of job applications, cover letters and resumes", "date": "Aug 19xx – May 20xx"}, {"role": "Criminal Justice/Shelter Advocate", "company": "Crisis Center Inc & Family Violence Coalition", "responsibilities": "Responded to crisis calls and provided support to victims of domestic abuse. Completed paperwork to document circumstances surrounding alleged abuse for judicial review", "date": "July 20xx – Oct 20xx"}, {"role": "Social Services Assistant", "company": "Tiffany Square Care Center", "responsibilities": "Conducted tours, provided orientation and general assistance for new residents. Completed social histories, inventoried clothing, and met one-on-one with residents to help them understand their rights and responsibilities. Assisted the Center in meeting critical staffing needs during peak times by working as a certified nursing assistant, dietary aide, receptionist and van driver", "date": "Jan 20xx – Sept 20xx"}], "trainings": ["BS in Human & Social Service Administration", "AAS in Human Services", "75-Hr Basic Nursing Assistant Program"], "certification": ["75-Hr Basic Nursing Assistant Program"], "contact": {"address": "3083 North South Street, Apt. A-1, Grand Island, Nebraska 68803", "mobile": "(308) 308-3083", "email": "imasample10@xxxx.net", "references": []}, "link": "data/livia_hoover_cv.pdf"}